app/controllers/collections_controller.rb

  def create
    @collection = Collection.find_or_create_by({tag: params[:tag], start_date: params[:start_date], end_date: params[:end_date]})
    !params[:search].blank? ? @tag = params[:search] : @tag = "all"

    response =  HTTParty.get("https://api.instagram.com/v1/tags/#{@tag}/media/recent?access_token=232747130.1677ed0.6096d8517e7e40658edbf5bfb138306a")
    response_body = JSON.parse(response.body)
    hashtag = params[:search].dup.prepend('#') if params[:search]
    if response_body["data"]
      response_body["data"].each do |result|
        filtered_result_data = InstaPost.filter_data(result, hashtag, @collection.start_date,@collection.end_date)
        @posts = InstaPost.create(ig_username: filtered_result_data[:ig_username], tag_time: filtered_result_data[:tag_time], content_type: filtered_result_data[:content_type], ig_link: filtered_result_data[:ig_link], image_url: filtered_result_data[:image_url], video_url: filtered_result_data[:video_url], description: filtered_result_data[:description], collection_id: @collection.id)
---
INSERT INTO "collections" ("tag", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["tag", ""], ["start_date", "2016-03-26 00:00:00.000000"], ["end_date", "2016-03-26 00:00:00.000000"], ["created_at", "2016-03-26 17:23:41.307981"], ["updated_at", "2016-03-26 17:23:41.307981"]]
SELECT  "collections".* FROM "collections" WHERE "collections"."start_date" = $1 AND "collections"."end_date" = $2 AND "collections"."tag" IS NULL LIMIT 1  [["start_date", "2016-03-01"], ["end_date", "2016-03-02"]]
INSERT INTO "insta_posts" ("ig_username", "tag_time", "content_type", "ig_link", "image_url", "video_url", "description", "collection_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def index
    posts = Collection.all
---
SELECT "collections".* FROM "collections"